Conpartir-war/web/WEB-INF/wsit-SOAPServer.SOAPServiceClient.xml

<?xml version="1.0" encoding="UTF-8"?> 
 <definitions 
 xmlns="http://schemas.xmlsoap.org/wsdl/" 
 xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" 
 xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
 xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" name="SOAPServiceClient" targetNamespace="http://SOAPServer/" xmlns:tns="http://SOAPServer/" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:fi="http://java.sun.com/xml/ns/wsit/2006/09/policy/fastinfoset/service" xmlns:tcp="http://java.sun.com/xml/ns/wsit/2006/09/policy/soaptcp/service" xmlns:sp="http://docs.oasis-open.org/ws-sx/ws-securitypolicy/200702" 
 >
    <message name="createClient_1"/>
    <message name="createClient_1Response"/>
    <message name="getTravels"/>
    <message name="getTravelsResponse"/>
    <message name="getTravelsFrom"/>
    <message name="getTravelsFromResponse"/>
    <message name="getClient"/>
    <message name="getClientResponse"/>
    <message name="getDriver"/>
    <message name="getDriverResponse"/>
    <message name="createCarTravel"/>
    <message name="createCarTravelResponse"/>
    <message name="getComments"/>
    <message name="getCommentsResponse"/>
    <message name="getFeedbackValue"/>
    <message name="getFeedbackValueResponse"/>
    <message name="getLatestComments"/>
    <message name="getLatestCommentsResponse"/>
    <message name="getTaxiTravels"/>
    <message name="getTaxiTravelsResponse"/>
    <message name="getTaxiTravelsFrom"/>
    <message name="getTaxiTravelsFromResponse"/>
    <message name="getDriverFromTravel"/>
    <message name="getDriverFromTravelResponse"/>
    <message name="createDriver"/>
    <message name="createDriverResponse"/>
    <message name="getDrivers"/>
    <message name="getDriversResponse"/>
    <message name="createTaxiTravel"/>
    <message name="createTaxiTravelResponse"/>
    <message name="createComment"/>
    <message name="createCommentResponse"/>
    <message name="getClientTravel"/>
    <message name="getClientTravelResponse"/>
    <message name="addPassenger"/>
    <message name="addPassengerResponse"/>
    <message name="getSpecificCarTravel"/>
    <message name="getSpecificCarTravelResponse"/>
    <message name="getSpecificTaxiTravel"/>
    <message name="getSpecificTaxiTravelResponse"/>
    <message name="editClient"/>
    <message name="editClientResponse"/>
    <message name="isTwitterOn"/>
    <message name="isTwitterOnResponse"/>
    <portType name="SOAPServiceClient">
        <operation name="createClient_1">
            <input message="tns:createClient_1"/>
            <output message="tns:createClient_1Response"/>
        </operation>
        <operation name="getTravels">
            <input message="tns:getTravels"/>
            <output message="tns:getTravelsResponse"/>
        </operation>
        <operation name="getTravelsFrom">
            <input message="tns:getTravelsFrom"/>
            <output message="tns:getTravelsFromResponse"/>
        </operation>
        <operation name="getClient">
            <input message="tns:getClient"/>
            <output message="tns:getClientResponse"/>
        </operation>
        <operation name="getDriver">
            <input message="tns:getDriver"/>
            <output message="tns:getDriverResponse"/>
        </operation>
        <operation name="createCarTravel">
            <input message="tns:createCarTravel"/>
            <output message="tns:createCarTravelResponse"/>
        </operation>
        <operation name="getComments">
            <input message="tns:getComments"/>
            <output message="tns:getCommentsResponse"/>
        </operation>
        <operation name="getFeedbackValue">
            <input message="tns:getFeedbackValue"/>
            <output message="tns:getFeedbackValueResponse"/>
        </operation>
        <operation name="getLatestComments">
            <input message="tns:getLatestComments"/>
            <output message="tns:getLatestCommentsResponse"/>
        </operation>
        <operation name="getTaxiTravels">
            <input message="tns:getTaxiTravels"/>
            <output message="tns:getTaxiTravelsResponse"/>
        </operation>
        <operation name="getTaxiTravelsFrom">
            <input message="tns:getTaxiTravelsFrom"/>
            <output message="tns:getTaxiTravelsFromResponse"/>
        </operation>
        <operation name="getDriverFromTravel">
            <input message="tns:getDriverFromTravel"/>
            <output message="tns:getDriverFromTravelResponse"/>
        </operation>
        <operation name="createDriver">
            <input message="tns:createDriver"/>
            <output message="tns:createDriverResponse"/>
        </operation>
        <operation name="getDrivers">
            <input message="tns:getDrivers"/>
            <output message="tns:getDriversResponse"/>
        </operation>
        <operation name="createTaxiTravel">
            <input message="tns:createTaxiTravel"/>
            <output message="tns:createTaxiTravelResponse"/>
        </operation>
        <operation name="createComment">
            <input message="tns:createComment"/>
            <output message="tns:createCommentResponse"/>
        </operation>
        <operation name="getClientTravel">
            <input message="tns:getClientTravel"/>
            <output message="tns:getClientTravelResponse"/>
        </operation>
        <operation name="addPassenger">
            <input message="tns:addPassenger"/>
            <output message="tns:addPassengerResponse"/>
        </operation>
        <operation name="getSpecificCarTravel">
            <input message="tns:getSpecificCarTravel"/>
            <output message="tns:getSpecificCarTravelResponse"/>
        </operation>
        <operation name="getSpecificTaxiTravel">
            <input message="tns:getSpecificTaxiTravel"/>
            <output message="tns:getSpecificTaxiTravelResponse"/>
        </operation>
        <operation name="editClient">
            <input message="tns:editClient"/>
            <output message="tns:editClientResponse"/>
        </operation>
        <operation name="isTwitterOn">
            <input message="tns:isTwitterOn"/>
            <output message="tns:isTwitterOnResponse"/>
        </operation>
    </portType>
    <binding name="SOAPServiceClientPortBinding" type="tns:SOAPServiceClient">
        <wsp:PolicyReference URI="#SOAPServiceClientPortBindingPolicy"/>
        <operation name="createClient_1">
            <input/>
            <output/>
        </operation>
        <operation name="getTravels">
            <input/>
            <output/>
        </operation>
        <operation name="getTravelsFrom">
            <input/>
            <output/>
        </operation>
        <operation name="getClient">
            <input/>
            <output/>
        </operation>
        <operation name="getDriver">
            <input/>
            <output/>
        </operation>
        <operation name="createCarTravel">
            <input/>
            <output/>
        </operation>
        <operation name="getComments">
            <input/>
            <output/>
        </operation>
        <operation name="getFeedbackValue">
            <input/>
            <output/>
        </operation>
        <operation name="getLatestComments">
            <input/>
            <output/>
        </operation>
        <operation name="getTaxiTravels">
            <input/>
            <output/>
        </operation>
        <operation name="getTaxiTravelsFrom">
            <input/>
            <output/>
        </operation>
        <operation name="getDriverFromTravel">
            <input/>
            <output/>
        </operation>
        <operation name="createDriver">
            <input/>
            <output/>
        </operation>
        <operation name="getDrivers">
            <input/>
            <output/>
        </operation>
        <operation name="createTaxiTravel">
            <input/>
            <output/>
        </operation>
        <operation name="createComment">
            <input/>
            <output/>
        </operation>
        <operation name="getClientTravel">
            <input/>
            <output/>
        </operation>
        <operation name="addPassenger">
            <input/>
            <output/>
        </operation>
        <operation name="getSpecificCarTravel">
            <input/>
            <output/>
        </operation>
        <operation name="getSpecificTaxiTravel">
            <input/>
            <output/>
        </operation>
        <operation name="editClient">
            <input/>
            <output/>
        </operation>
        <operation name="isTwitterOn">
            <input/>
            <output/>
        </operation>
    </binding>
    <service name="SOAPServiceClient">
        <port name="SOAPServiceClientPort" binding="tns:SOAPServiceClientPortBinding"/>
    </service>
    <wsp:Policy wsu:Id="SOAPServiceClientPortBindingPolicy">
        <wsp:ExactlyOne>
            <wsp:All/>
        </wsp:ExactlyOne>
    </wsp:Policy>
    <wsp:Policy wsu:Id="SOAPServiceClientPortBinding_createDriver_Input_Policy">
        <wsp:ExactlyOne>
            <wsp:All>
                <sp:EncryptedParts>
                    <sp:Body/>
                </sp:EncryptedParts>
                <sp:SignedParts>
                    <sp:Body/>
                </sp:SignedParts>
            </wsp:All>
        </wsp:ExactlyOne>
    </wsp:Policy>
    <wsp:Policy wsu:Id="SOAPServiceClientPortBinding_createDriver_Output_Policy">
        <wsp:ExactlyOne>
            <wsp:All>
                <sp:EncryptedParts>
                    <sp:Body/>
                </sp:EncryptedParts>
                <sp:SignedParts>
                    <sp:Body/>
                </sp:SignedParts>
            </wsp:All>
        </wsp:ExactlyOne>
    </wsp:Policy>
    <wsp:Policy wsu:Id="SOAPServiceClientPortBinding_createPost_Input_Policy">
        <wsp:ExactlyOne>
            <wsp:All>
                <sp:EncryptedParts>
                    <sp:Body/>
                </sp:EncryptedParts>
                <sp:SignedParts>
                    <sp:Body/>
                </sp:SignedParts>
            </wsp:All>
        </wsp:ExactlyOne>
    </wsp:Policy>
    <wsp:Policy wsu:Id="SOAPServiceClientPortBinding_createPost_Output_Policy">
        <wsp:ExactlyOne>
            <wsp:All>
                <sp:EncryptedParts>
                    <sp:Body/>
                </sp:EncryptedParts>
                <sp:SignedParts>
                    <sp:Body/>
                </sp:SignedParts>
            </wsp:All>
        </wsp:ExactlyOne>
    </wsp:Policy>
    <wsp:Policy wsu:Id="SOAPServiceClientPortBinding_getDriver_Input_Policy">
        <wsp:ExactlyOne>
            <wsp:All>
                <sp:EncryptedParts>
                    <sp:Body/>
                </sp:EncryptedParts>
                <sp:SignedParts>
                    <sp:Body/>
                </sp:SignedParts>
            </wsp:All>
        </wsp:ExactlyOne>
    </wsp:Policy>
    <wsp:Policy wsu:Id="SOAPServiceClientPortBinding_getDriver_Output_Policy">
        <wsp:ExactlyOne>
            <wsp:All>
                <sp:EncryptedParts>
                    <sp:Body/>
                </sp:EncryptedParts>
                <sp:SignedParts>
                    <sp:Body/>
                </sp:SignedParts>
            </wsp:All>
        </wsp:ExactlyOne>
    </wsp:Policy>
    <wsp:Policy wsu:Id="SOAPServiceClientPortBinding_searchTravel_Input_Policy">
        <wsp:ExactlyOne>
            <wsp:All>
                <sp:EncryptedParts>
                    <sp:Body/>
                </sp:EncryptedParts>
                <sp:SignedParts>
                    <sp:Body/>
                </sp:SignedParts>
            </wsp:All>
        </wsp:ExactlyOne>
    </wsp:Policy>
    <wsp:Policy wsu:Id="SOAPServiceClientPortBinding_searchTravel_Output_Policy">
        <wsp:ExactlyOne>
            <wsp:All>
                <sp:EncryptedParts>
                    <sp:Body/>
                </sp:EncryptedParts>
                <sp:SignedParts>
                    <sp:Body/>
                </sp:SignedParts>
            </wsp:All>
        </wsp:ExactlyOne>
    </wsp:Policy>
    <wsp:Policy wsu:Id="SOAPServiceClientPortBinding_getTravelDriver_Input_Policy">
        <wsp:ExactlyOne>
            <wsp:All>
                <sp:EncryptedParts>
                    <sp:Body/>
                </sp:EncryptedParts>
                <sp:SignedParts>
                    <sp:Body/>
                </sp:SignedParts>
            </wsp:All>
        </wsp:ExactlyOne>
    </wsp:Policy>
    <wsp:Policy wsu:Id="SOAPServiceClientPortBinding_getTravelDriver_Output_Policy">
        <wsp:ExactlyOne>
            <wsp:All>
                <sp:EncryptedParts>
                    <sp:Body/>
                </sp:EncryptedParts>
                <sp:SignedParts>
                    <sp:Body/>
                </sp:SignedParts>
            </wsp:All>
        </wsp:ExactlyOne>
    </wsp:Policy>
    <wsp:Policy wsu:Id="SOAPServiceClientPortBinding_createTaxiTravel_Input_Policy">
        <wsp:ExactlyOne>
            <wsp:All>
                <sp:EncryptedParts>
                    <sp:Body/>
                </sp:EncryptedParts>
                <sp:SignedParts>
                    <sp:Body/>
                </sp:SignedParts>
            </wsp:All>
        </wsp:ExactlyOne>
    </wsp:Policy>
    <wsp:Policy wsu:Id="SOAPServiceClientPortBinding_createTaxiTravel_Output_Policy">
        <wsp:ExactlyOne>
            <wsp:All>
                <sp:EncryptedParts>
                    <sp:Body/>
                </sp:EncryptedParts>
                <sp:SignedParts>
                    <sp:Body/>
                </sp:SignedParts>
            </wsp:All>
        </wsp:ExactlyOne>
    </wsp:Policy>
    <wsp:Policy wsu:Id="SOAPServiceClientPortBinding_getFeedback_Input_Policy">
        <wsp:ExactlyOne>
            <wsp:All>
                <sp:EncryptedParts>
                    <sp:Body/>
                </sp:EncryptedParts>
                <sp:SignedParts>
                    <sp:Body/>
                </sp:SignedParts>
            </wsp:All>
        </wsp:ExactlyOne>
    </wsp:Policy>
    <wsp:Policy wsu:Id="SOAPServiceClientPortBinding_getFeedback_Output_Policy">
        <wsp:ExactlyOne>
            <wsp:All>
                <sp:EncryptedParts>
                    <sp:Body/>
                </sp:EncryptedParts>
                <sp:SignedParts>
                    <sp:Body/>
                </sp:SignedParts>
            </wsp:All>
        </wsp:ExactlyOne>
    </wsp:Policy>
    <wsp:Policy wsu:Id="SOAPServiceClientPortBinding_getDriverFromTravel_Input_Policy">
        <wsp:ExactlyOne>
            <wsp:All>
                <sp:EncryptedParts>
                    <sp:Body/>
                </sp:EncryptedParts>
                <sp:SignedParts>
                    <sp:Body/>
                </sp:SignedParts>
            </wsp:All>
        </wsp:ExactlyOne>
    </wsp:Policy>
    <wsp:Policy wsu:Id="SOAPServiceClientPortBinding_getDriverFromTravel_Output_Policy">
        <wsp:ExactlyOne>
            <wsp:All>
                <sp:EncryptedParts>
                    <sp:Body/>
                </sp:EncryptedParts>
                <sp:SignedParts>
                    <sp:Body/>
                </sp:SignedParts>
            </wsp:All>
        </wsp:ExactlyOne>
    </wsp:Policy>
    <wsp:Policy wsu:Id="SOAPServiceClientPortBinding_getDriverIf_Input_Policy">
        <wsp:ExactlyOne>
            <wsp:All>
                <sp:EncryptedParts>
                    <sp:Body/>
                </sp:EncryptedParts>
                <sp:SignedParts>
                    <sp:Body/>
                </sp:SignedParts>
            </wsp:All>
        </wsp:ExactlyOne>
    </wsp:Policy>
    <wsp:Policy wsu:Id="SOAPServiceClientPortBinding_getDriverIf_Output_Policy">
        <wsp:ExactlyOne>
            <wsp:All>
                <sp:EncryptedParts>
                    <sp:Body/>
                </sp:EncryptedParts>
                <sp:SignedParts>
                    <sp:Body/>
                </sp:SignedParts>
            </wsp:All>
        </wsp:ExactlyOne>
    </wsp:Policy>
    <wsp:Policy wsu:Id="SOAPServiceClientPortBinding_getCommentsPosted_Input_Policy">
        <wsp:ExactlyOne>
            <wsp:All>
                <sp:EncryptedParts>
                    <sp:Body/>
                </sp:EncryptedParts>
                <sp:SignedParts>
                    <sp:Body/>
                </sp:SignedParts>
            </wsp:All>
        </wsp:ExactlyOne>
    </wsp:Policy>
    <wsp:Policy wsu:Id="SOAPServiceClientPortBinding_getCommentsPosted_Output_Policy">
        <wsp:ExactlyOne>
            <wsp:All>
                <sp:EncryptedParts>
                    <sp:Body/>
                </sp:EncryptedParts>
                <sp:SignedParts>
                    <sp:Body/>
                </sp:SignedParts>
            </wsp:All>
        </wsp:ExactlyOne>
    </wsp:Policy>
    <wsp:Policy wsu:Id="SOAPServiceClientPortBinding_createCommet_Input_Policy">
        <wsp:ExactlyOne>
            <wsp:All>
                <sp:EncryptedParts>
                    <sp:Body/>
                </sp:EncryptedParts>
                <sp:SignedParts>
                    <sp:Body/>
                </sp:SignedParts>
            </wsp:All>
        </wsp:ExactlyOne>
    </wsp:Policy>
    <wsp:Policy wsu:Id="SOAPServiceClientPortBinding_createCommet_Output_Policy">
        <wsp:ExactlyOne>
            <wsp:All>
                <sp:EncryptedParts>
                    <sp:Body/>
                </sp:EncryptedParts>
                <sp:SignedParts>
                    <sp:Body/>
                </sp:SignedParts>
            </wsp:All>
        </wsp:ExactlyOne>
    </wsp:Policy>
</definitions>
